coocox/Mplib/Toshaba/TMPM36x/TMPM362/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM362.s
;/**
; ***************************************************************************
; * @file     startup_TMPM362.s
; * @brief    CMSIS Cortex-M3 Core Device Startup File for the
; *           TOSHIBA 'TMPM362' Device Series 
; * @version  V2.2.0
; * @date     2010/07/09
; * 
; * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
; * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
; * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
; * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
; * 
; * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
; * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
; * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
; * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
; * 
; * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
; * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
; * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
; * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
; * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
; * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
; * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
; * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
; * 
; * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
; *****************************************************************************
; */
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; Cortex-M version
;

                MODULE  ?cstartup

                ;; Forward declaration of sections.
                SECTION CSTACK:DATA:NOROOT(3)

                SECTION .intvec:CODE:NOROOT(2)

                EXTERN  __iar_program_start
                EXTERN  SystemInit
                PUBLIC  __vector_table

                DATA
__vector_table  DCD     sfe(CSTACK)
                DCD     Reset_Handler

                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     INT0_IRQHandler           ; 0:  Interrupt pin 0
                DCD     INT1_IRQHandler           ; 1:  Interrupt pin 1
                DCD     INT2_IRQHandler           ; 2:  Interrupt pin 2
                DCD     INT3_IRQHandler           ; 3:  Interrupt pin 3
                DCD     INT4_IRQHandler           ; 4:  Interrupt pin 4
                DCD     INT5_IRQHandler           ; 5:  Interrupt pin 5
                DCD     INT6_IRQHandler           ; 6:  Interrupt pin 6
                DCD     INT7_IRQHandler           ; 7:  Interrupt pin 7
                DCD     INT8_IRQHandler           ; 8:  Interrupt pin 8
                DCD     INT9_IRQHandler           ; 9:  Interrupt pin 9
                DCD     INTA_IRQHandler           ; 10: Interrupt pin A
                DCD     INTB_IRQHandler           ; 11: Interrupt pin B
                DCD     INTC_IRQHandler           ; 12: Interrupt pin C
                DCD     INTD_IRQHandler           ; 13: Interrupt pin D
                DCD     INTE_IRQHandler           ; 14: Interrupt pin E
                DCD     INTF_IRQHandler           ; 15: Interrupt pin F
                DCD     INTRX0_IRQHandler         ; 16:  Serial reception (channel.0)
                DCD     INTTX0_IRQHandler         ; 17:  Serial transmission (channel.0)
                DCD     INTRX1_IRQHandler         ; 18:  Serial reception (channel.1)
                DCD     INTTX1_IRQHandler         ; 19:  Serial transmission (channel.1)
                DCD     INTRX2_IRQHandler         ; 20:  Serial reception (channel.2)
                DCD     INTTX2_IRQHandler         ; 21:  Serial transmission (channel.2)
                DCD     INTRX3_IRQHandler         ; 22:  Serial reception (channel.3)
                DCD     INTTX3_IRQHandler         ; 23:  Serial transmission (channel.3)
                DCD     INTRX4_IRQHandler         ; 24:  Serial reception (channel.4)
                DCD     INTTX4_IRQHandler         ; 25:  Serial transmission (channel.4)
                DCD     INTSBI0_IRQHandler        ; 26: Serial bus interface (channel.0)
                DCD     INTSBI1_IRQHandler        ; 27: Serial bus interface (channel.1)
                DCD     INTCECRX_IRQHandler       ; 28: CEC reception
                DCD     INTCECTX_IRQHandler       ; 29: CEC transmission
                DCD     INTRMCRX0_IRQHandler      ; 30: Remote control signal reception (channel.0)
                DCD     INTRMCRX1_IRQHandler      ; 31: Remote control signal reception (channel.1)
                DCD     INTRTC_IRQHandler         ; 32: Real time clock timer
                DCD     INTKWUP_IRQHandler        ; 33: Key on wake up
                DCD     INTSBI2_IRQHandler        ; 34: Serial bus interface (channel.2)
                DCD     INTSBI3_IRQHandler        ; 35: Serial bus interface (channel.3)
                DCD     INTSBI4_IRQHandler        ; 36: Serial bus interface (channel.4)
                DCD     INTADHP_IRQHandler        ; 37: Highest priority AD conversion complete interrupt 
                DCD     INTADM0_IRQHandler        ; 38: AD conversion monitoring function interrupt 0
                DCD     INTADM1_IRQHandler        ; 39: AD conversion monitoring function interrupt 1
                DCD     INTTB0_IRQHandler         ; 40: 16bit TMRB match detection 0
                DCD     INTTB1_IRQHandler         ; 41: 16bit TMRB match detection 1
                DCD     INTTB2_IRQHandler         ; 42: 16bit TMRB match detection 2
                DCD     INTTB3_IRQHandler         ; 43: 16bit TMRB match detection 3
                DCD     INTTB4_IRQHandler         ; 44: 16bit TMRB match detection 4
                DCD     INTTB5_IRQHandler         ; 45: 16bit TMRB match detection 5
                DCD     INTTB6_IRQHandler         ; 46: 16bit TMRB match detection 6
                DCD     INTTB7_IRQHandler         ; 47: 16bit TMRB match detection 7
                DCD     INTTB8_IRQHandler         ; 48: 16bit TMRB match detection 8
                DCD     INTTB9_IRQHandler         ; 49: 16bit TMRB match detection 9
                DCD     INTTBA_IRQHandler         ; 50: 16bit TMRB match detection A
                DCD     INTTBB_IRQHandler         ; 51: 16bit TMRB match detection B
                DCD     INTTBC_IRQHandler         ; 52: 16bit TMRB match detection C
                DCD     INTTBD_IRQHandler         ; 53: 16bit TMRB match detection D
                DCD     INTTBE_IRQHandler         ; 54: 16bit TMRB match detection E
                DCD     INTTBF_IRQHandler         ; 55: 16bit TMRB match detection F
                DCD     0                         ; 56: Reserved
                DCD     0                         ; 57: Reserved
                DCD     INTAD_IRQHandler          ; 58: ADC conversion completion
                DCD     INTSSP_IRQHandler         ; 59: Synchronous Serial Port
                DCD     INTRX5_IRQHandler         ; 60: Serial reception (channel.5)
                DCD     INTTX5_IRQHandler         ; 61: Serial transmission (channel.5)
                DCD     INTRX6_IRQHandler         ; 62: Serial reception (channel.6)
                DCD     INTTX6_IRQHandler         ; 63: Serial transmission (channel.6)
                DCD     INTRX7_IRQHandler         ; 64: Serial reception (channel.7)
                DCD     INTTX7_IRQHandler         ; 65: Serial transmission (channel.7)
                DCD     INTRX8_IRQHandler         ; 66: Serial reception (channel.8)
                DCD     INTTX8_IRQHandler         ; 67: Serial transmission (channel.8)
                DCD     INTRX9_IRQHandler         ; 68: Serial reception (channel.9)
                DCD     INTTX9_IRQHandler         ; 69: Serial transmission (channel.9)
                DCD     INTRX10_IRQHandler        ; 70: Serial reception (channel.10)
                DCD     INTTX10_IRQHandler        ; 71: Serial transmission (channel.10)
                DCD     INTRX11_IRQHandler        ; 72: Serial reception (channel.11)
                DCD     INTTX11_IRQHandler        ; 73: Serial transmission (channel.11)
                DCD     INTCAP10_IRQHandler       ; 74: 16bit TMRB input capture 10
                DCD     INTCAP11_IRQHandler       ; 75: 16bit TMRB input capture 11
                DCD     INTCAP20_IRQHandler       ; 76: 16bit TMRB input capture 20
                DCD     INTCAP21_IRQHandler       ; 77: 16bit TMRB input capture 21
                DCD     0                         ; 78: Reserved
                DCD     0                         ; 79: Reserved
                DCD     INTCAP50_IRQHandler       ; 80: 16bit TMRB input capture 50
                DCD     INTCAP51_IRQHandler       ; 81: 16bit TMRB input capture 51
                DCD     INTCAP60_IRQHandler       ; 82: 16bit TMRB input capture 60
                DCD     INTCAP61_IRQHandler       ; 83: 16bit TMRB input capture 61
                DCD     INTCAP70_IRQHandler       ; 84: 16bit TMRB input capture 70
                DCD     INTCAP71_IRQHandler       ; 85: 16bit TMRB input capture 71
                DCD     INTCAP90_IRQHandler       ; 86: 16bit TMRB input capture 90
                DCD     INTCAP91_IRQHandler       ; 87: 16bit TMRB input capture 91
                DCD     INTCAPA0_IRQHandler       ; 88: 16bit TMRB input capture A0
                DCD     INTCAPA1_IRQHandler       ; 89: 16bit TMRB input capture A1
                DCD     INTCAPB0_IRQHandler       ; 90: 16bit TMRB input capture B0
                DCD     INTCAPB1_IRQHandler       ; 91: 16bit TMRB input capture B1
                DCD     INTCAPD0_IRQHandler       ; 92: 16bit TMRB input capture D0
                DCD     INTCAPD1_IRQHandler       ; 93: 16bit TMRB input capture D1
                DCD     INTCAPE0_IRQHandler       ; 94: 16bit TMRB input capture E0
                DCD     INTCAPE1_IRQHandler       ; 95: 16bit TMRB input capture E1
                DCD     INTCAPF0_IRQHandler       ; 96: 16bit TMRB input capture F0
                DCD     INTCAPF1_IRQHandler       ; 97: 16bit TMRB input capture F1
                DCD     INTDMACERR_IRQHandler     ; 98: DMA transmission error
                DCD     INTDMACTC0_IRQHandler     ; 99: DMA transmission completion

                THUMB
; Dummy Exception Handlers (infinite loops which can be modified)

                PUBWEAK Reset_Handler
                SECTION .text:CODE:REORDER(2)
Reset_Handler
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0

                PUBWEAK NMI_Handler
                SECTION .text:CODE:REORDER(1)
NMI_Handler
                B       NMI_Handler

                PUBWEAK HardFault_Handler
                SECTION .text:CODE:REORDER(1)
HardFault_Handler
                B       HardFault_Handler

                PUBWEAK MemManage_Handler
                SECTION .text:CODE:REORDER(1)
MemManage_Handler
                B       MemManage_Handler

                PUBWEAK BusFault_Handler
                SECTION .text:CODE:REORDER(1)
BusFault_Handler
                B       BusFault_Handler

