coocox/Mplib/Toshaba/TMPM36x/TMPM362/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM362.s
                PUBWEAK INTCAP71_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP71_IRQHandler
                B       INTCAP71_IRQHandler

                PUBWEAK INTCAP90_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP90_IRQHandler
                B       INTCAP90_IRQHandler

                PUBWEAK INTCAP91_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP91_IRQHandler
                B       INTCAP91_IRQHandler 

                PUBWEAK INTCAPA0_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAPA0_IRQHandler
                B       INTCAPA0_IRQHandler

                PUBWEAK INTCAPA1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPA1_IRQHandler
                B       INTCAPA1_IRQHandler

                PUBWEAK INTCAPB0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPB0_IRQHandler
                B       INTCAPB0_IRQHandler

                PUBWEAK INTCAPB1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPB1_IRQHandler
                B       INTCAPB1_IRQHandler

                PUBWEAK INTCAPD0_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAPD0_IRQHandler
                B       INTCAPD0_IRQHandler

                PUBWEAK INTCAPD1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPD1_IRQHandler
                B       INTCAPD1_IRQHandler 

                PUBWEAK INTCAPE0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPE0_IRQHandler
                B       INTCAPE0_IRQHandler

                PUBWEAK INTCAPE1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPE1_IRQHandler
                B       INTCAPE1_IRQHandler

                PUBWEAK INTCAPF0_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAPF0_IRQHandler
                B       INTCAPF0_IRQHandler

                PUBWEAK INTCAPF1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPF1_IRQHandler
                B       INTCAPF1_IRQHandler

                PUBWEAK INTDMACERR_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMACERR_IRQHandler
                B       INTDMACERR_IRQHandler

                PUBWEAK INTDMACTC0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMACTC0_IRQHandler
                B       INTDMACTC0_IRQHandler

                END
